# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2025-02-15 18:10:39 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TAGS: web(w)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* kryLisp [0/0]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
  kryLisp is a simple Lisp interpreter written in Go.
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 202 :emphasize t
   #+CAPTION: Clock summary at [2025-02-15 Sa 18:10]
   | Headline                | Time   |        |      |
   |-------------------------+--------+--------+------|
   | *Total time*            | *4:01* |        |      |
   |-------------------------+--------+--------+------|
   | *kryLisp [0/0]*         | *4:01* |        |      |
   | \_  /Components [0/0]/  |        | /4:01/ |      |
   | \_    Parser [0/0]      |        |        | 2:11 |
   | \_    Interpreter [0/0] |        |        | 1:50 |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Parser [0/0]
    :LOGBOOK:
    CLOCK: [2025-02-13 Do 14:44]--[2025-02-13 Do 16:55] =>  2:11
    :END:
    I am going to give Participle a try. In a prior attempt I used gocc, but
    ... I wasn't really happy with it, I don't remember why.
    [2025-02-13 Do 15:44]
    After a long period of procrastination and banging my head against the
    desk I have finally started to understand how participle works and how to
    use it, and now that I am over that hump, I have to say it's pretty nice,
    at least so far.
*** Interpreter [0/0]
    :LOGBOOK:
    CLOCK: [2025-02-15 Sa 17:34]--[2025-02-15 Sa 18:09] =>  0:35
    CLOCK: [2025-02-15 Sa 15:21]--[2025-02-15 Sa 16:36] =>  1:15
    :END:
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
